app/controllers/homes_controller.rb

  def index
    @goal = Goal.all()
---
SELECT "goals".* FROM "goals"

  def show2
    @result = []
    if params[:healthy] != nil
      goal = Goal.find_by(name: 'healthy')
      goal.check = "true"
      goal.save
      @result.push(Habit.where(goal_id: goal.id))
    end

    if params[:clean] != nil
      goal = Goal.find_by(name: 'clean')
      goal.check = "true"
      goal.save
      @result.push(Habit.where(goal_id: goal.id))
---
SELECT  "goals".* FROM "goals" WHERE "goals"."name" = ? LIMIT ?  [["name", "healthy"], ["LIMIT", 1]]
UPDATE "goals" SET "check" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["check", "true"], ["updated_at", "2019-11-16 08:45:03.891417"], ["id", 1]]
UPDATE "goals" SET "check" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["check", "true"], ["updated_at", "2019-11-16 08:14:35.750900"], ["id", 1]]
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 1]]
SELECT  "goals".* FROM "goals" WHERE "goals"."name" = ? LIMIT ?  [["name", "clean"], ["LIMIT", 1]]
UPDATE "goals" SET "check" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["check", "true"], ["updated_at", "2019-11-16 08:45:03.912975"], ["id", 2]]
UPDATE "goals" SET "check" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["check", "true"], ["updated_at", "2019-11-16 08:18:03.338035"], ["id", 2]]
SELECT "habits".* FROM "habits" WHERE "habits"."goal_id" = ?  [["goal_id", 2]]